<!doctype html><html><head><meta charset="utf-8"><title>Synthetic Report</title><style>table{border-collapse:collapse;width:100%}th,td{border:1px solid #ddd;padding:8px}th{background:#f2f2f2;text-align:left}</style></head><body><h1>Synthetic Report</h1><h2>Environment</h2><table><tbody><tr><th style="text-align:left;padding:8px">Base image</th><td style="padding:8px">nvcr.io/nvidia/tritonserver@sha256:0190dbdba3012f0c3ed9a7eaf57f0c8612443b36a3fbcbb4cff807a74dbdb819</td></tr><tr><th style="text-align:left;padding:8px">Operating system</th><td style="padding:8px">ubuntu 22.04</td></tr></tbody></table><h2>Counts</h2><table><thead><tr><th style="text-align:left;padding:8px">Metric</th><th style="text-align:left;padding:8px">Count</th></tr></thead><tbody><tr><td style="padding:8px">VULNERABILITIES - CRITICAL</td><td style="padding:8px">30</td></tr><tr><td style="padding:8px">VULNERABILITIES - HIGH</td><td style="padding:8px">978</td></tr></tbody></table><h2>Trivy Vulnerabilities</h2><p>Threshold: <b>HIGH</b></p><table><thead><tr><th>ID</th><th>Package</th><th>Severity</th><th>Description</th></tr></thead><tbody><tr><td>CVE-2023-38545</td><td>curl</td><td>CRITICAL</td><td><pre style="white-space:pre-wrap;margin:0;">This flaw makes curl overflow a heap based buffer in the SOCKS5 proxy
handshake.

When curl is asked to pass along the host name to the SOCKS5 proxy to allow
that to resolve the address instead of it getting done by curl itself, the

no data buffer.</pre></td></tr><tr><td>CVE-2022-25836</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">Bluetooth® Low Energy Pairing in Bluetooth Core Specification v4.0 through v5.3 may permit an unauthenticated MITM to acquire credentials with two pairing devices via adjacent access when the MITM negotiates Legacy Passkey Pairing with the pairing Initiator and Secure Connections Passkey Pairing with the pairing Responder and brute forces the Passkey entered by the user into the Initiator. The MITM attacker can use the identified Passkey value to complete authentication with the Responder via Bluetooth pairing method confusion.</pre></td></tr><tr><td>CVE-2022-2961</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">A use-after-free flaw was found in the Linux kernel’s PLP Rose functionality in the way a user triggers a race condition by calling bind while simultaneously triggering the rose_bind() function. This flaw allows a local user to crash or potentially escalate their privileges on the system.</pre></td></tr><tr><td>CVE-2022-3238</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">A double-free flaw was found in the Linux kernel’s NTFS3 subsystem in how a user triggers remount and umount simultaneously. This flaw allows a local user to crash or potentially escalate their privileges on the system.</pre></td></tr><tr><td>CVE-2022-45884</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">An issue was discovered in the Linux kernel through 6.0.9. drivers/media/dvb-core/dvbdev.c has a use-after-free, related to dvb_register_device dynamically allocating fops.</pre></td></tr><tr><td>CVE-2022-45885</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">An issue was discovered in the Linux kernel through 6.0.9. drivers/media/dvb-core/dvb_frontend.c has a race condition that can cause a use-after-free when a device is disconnected.</pre></td></tr><tr><td>CVE-2022-45886</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">An issue was discovered in the Linux kernel through 6.0.9. drivers/media/dvb-core/dvb_net.c has a .disconnect versus dvb_device_open race condition that leads to a use-after-free.</pre></td></tr><tr><td>CVE-2022-45919</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">An issue was discovered in the Linux kernel through 6.0.10. In drivers/media/dvb-core/dvb_ca_en50221.c, a use-after-free can occur is there is a disconnect after an open, because of the lack of a wait_event.</pre></td></tr><tr><td>CVE-2022-48425</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">In the Linux kernel through 6.2.7, fs/ntfs3/inode.c has an invalid kfree because it does not validate MFT flags before replaying logs.</pre></td></tr><tr><td>CVE-2022-48502</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">An issue was discovered in the Linux kernel before 6.2. The ntfs3 subsystem does not properly check for correctness during disk reads, leading to an out-of-bounds read in ntfs_set_ea in fs/ntfs3/xattr.c.</pre></td></tr><tr><td>CVE-2022-48744</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">In the Linux kernel, the following vulnerability has been resolved:

net/mlx5e: Avoid field-overflowing memcpy()

In preparation for FORTIFY_SOURCE performing compile-time and run-time
field bounds checking for memcpy(), memmove(), and memset(), avoid
intentionally writing across neighboring fields.

Use flexible arrays instead of zero-element arrays (which look like they
are always overflowing) and split the cross-field memcpy() into two halves
that can be appropriately bounds-checked by the compiler.

We were doing:

	#define ETH_HLEN  14
	#define VLAN_HLEN  4
	...
	#define MLX5E_XDP_MIN_INLINE (ETH_HLEN + VLAN_HLEN)
	...
        struct mlx5e_tx_wqe      *wqe  = mlx5_wq_cyc_get_wqe(wq, pi);
	...
        struct mlx5_wqe_eth_seg  *eseg = &amp;wqe-&gt;eth;
        struct mlx5_wqe_data_seg *dseg = wqe-&gt;data;
	...
	memcpy(eseg-&gt;inline_hdr.start, xdptxd-&gt;data, MLX5E_XDP_MIN_INLINE);

target is wqe-&gt;eth.inline_hdr.start (which the compiler sees as being
2 bytes in size), but copying 18, intending to write across start
(really vlan_tci, 2 bytes). The remaining 16 bytes get written into
wqe-&gt;data[0], covering byte_count (4 bytes), lkey (4 bytes), and addr
(8 bytes).

struct mlx5e_tx_wqe {
        struct mlx5_wqe_ctrl_seg   ctrl;                 /*     0    16 */
        struct mlx5_wqe_eth_seg    eth;                  /*    16    16 */
        struct mlx5_wqe_data_seg   data[];               /*    32     0 */

        /* size: 32, cachelines: 1, members: 3 */
        /* last cacheline: 32 bytes */
};

struct mlx5_wqe_eth_seg {
        u8                         swp_outer_l4_offset;  /*     0     1 */
        u8                         swp_outer_l3_offset;  /*     1     1 */
        u8                         swp_inner_l4_offset;  /*     2     1 */
        u8                         swp_inner_l3_offset;  /*     3     1 */
        u8                         cs_flags;             /*     4     1 */
        u8                         swp_flags;            /*     5     1 */
        __be16                     mss;                  /*     6     2 */
        __be32                     flow_table_metadata;  /*     8     4 */
        union {
                struct {
                        __be16     sz;                   /*    12     2 */
                        u8         start[2];             /*    14     2 */
                } inline_hdr;                            /*    12     4 */
                struct {
                        __be16     type;                 /*    12     2 */
                        __be16     vlan_tci;             /*    14     2 */
                } insert;                                /*    12     4 */
                __be32             trailer;              /*    12     4 */
        };                                               /*    12     4 */

        /* size: 16, cachelines: 1, members: 9 */
        /* last cacheline: 16 bytes */
};

struct mlx5_wqe_data_seg {
        __be32                     byte_count;           /*     0     4 */
        __be32                     lkey;                 /*     4     4 */
        __be64                     addr;                 /*     8     8 */

        /* size: 16, cachelines: 1, members: 3 */
        /* last cacheline: 16 bytes */
};

So, split the memcpy() so the compiler can reason about the buffer
sizes.

&quot;pahole&quot; shows no size nor member offset changes to struct mlx5e_tx_wqe
nor struct mlx5e_umr_wqe. &quot;objdump -d&quot; shows no meaningful object
code changes (i.e. only source line number induced differences and
optimizations).</pre></td></tr><tr><td>CVE-2022-48771</td><td>linux-libc-dev</td><td>HIGH</td><td><pre style="white-space:pre-wrap;margin:0;">In the Linux kernel, the following vulnerability has been resolved:

drm/vmwgfx: Fix stale file descriptors on failed usercopy

A failing usercopy of the fence_rep object will lead to a stale entry in
the file descriptor table as put_unused_fd() won&#x27;t release it. This
enables userland to refer to a dangling &#x27;file&#x27; object through that still
valid file descriptor, leading to all kinds of use-after-free
